basic-graph-traversal-in-ocaml.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-03-04 Sat 00:18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Basic Graph Traversal in OCaml</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Bryan Garza">
<meta name="description" content="Solution to a graph problem from CTCI"
>
<meta name="keywords" content="ocaml, algorithms, graphs, cracking the coding interview">

<link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
<link href="./css/styles2.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="./css/styles.css"/>
</head>
<body>
<div id="preamble" class="status">
<h1 class="title"><a href="http://bryangarza.github.io">Bryan Garza</a></h1>
</div>
<div id="content">
<p>
<div class="outline-3"><h3><a href="./basic-graph-traversal-in-ocaml.html"> Basic Graph Traversal in OCaml</a><span> </span><span class="timestamp-wrapper"><span class="timestamp">( January 28, 2016)</span></span></h3>
</p>

<p>
This is my solution to Cracking The Coding Interview problem 4.2.
The problem is: Given a directed graph, design an algorithm to find out whether
there is a route between two nodes.
</p>

<p>
Keep in mind that I&rsquo;ve only been writing OCaml for a few weeks. There is
probably a more elegant solution. Once my OCaml is more advanced, I&rsquo;ll make a
new post. This solution does BFS traversal, returning <code>None</code> early when it can&rsquo;t
traverse any further and hasn&rsquo;t reached the destination node.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">module</span> <span class="org-tuareg-font-lock-module">Graph</span> <span class="org-tuareg-font-lock-operator">=</span>
<span class="org-tuareg-font-lock-governing">struct</span>
  <span class="org-tuareg-font-lock-governing">type</span> <span class="org-type">node</span>   <span class="org-tuareg-font-lock-operator">=</span> int
  <span class="org-tuareg-font-lock-governing">type</span> <span class="org-type">graph</span>  <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">{</span></span> nodes <span class="org-tuareg-font-lock-operator">:</span> node list<span class="org-tuareg-font-lock-operator">;</span> edges <span class="org-tuareg-font-lock-operator">:</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span>node<span class="org-tuareg-font-lock-operator">*</span>node<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span> list <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">}</span></span>
  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">mk</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">{</span></span> nodes<span class="org-tuareg-font-lock-operator">=</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">[]</span></span> <span class="org-tuareg-font-lock-operator">;</span> edges<span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">[]</span></span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">}</span></span>

  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">mk_outgoing</span><span class="org-variable-name"> g</span> <span class="org-tuareg-font-lock-operator">=</span>
    <span class="org-keyword">fun</span> <span class="org-variable-name">n</span> <span class="org-tuareg-font-lock-operator">-&gt;</span>
      <span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">keep</span><span class="org-variable-name"> </span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-variable-name">left</span><span class="org-tuareg-font-lock-operator">,</span><span class="org-variable-name">_</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-variable-name"> </span><span class="org-keyword">as</span><span class="org-variable-name"> edge</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span><span class="org-variable-name"> acc</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-keyword">if</span> left <span class="org-tuareg-font-lock-operator">=</span> n <span class="org-keyword">then</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">[</span></span>edge<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">]</span></span> <span class="org-tuareg-font-lock-operator">@</span> acc <span class="org-keyword">else</span> acc <span class="org-tuareg-font-lock-governing">in</span>
      <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">next_to</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">List.</span>fold_right g.edges <span class="org-tuareg-font-lock-label">~f</span><span class="org-tuareg-font-lock-operator">:</span>keep <span class="org-tuareg-font-lock-label">~init</span><span class="org-tuareg-font-lock-operator">:</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">[]</span></span> <span class="org-tuareg-font-lock-governing">in</span>
      <span class="org-tuareg-font-lock-module">Int.Set.</span>of_list <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-tuareg-font-lock-module">List.</span>map next_to <span class="org-tuareg-font-lock-label">~f</span><span class="org-tuareg-font-lock-operator">:</span><span class="org-type">snd</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>

  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">bfs_traverse_until</span><span class="org-variable-name"> g root </span><span class="org-tuareg-font-lock-label">~f</span><span class="org-tuareg-font-lock-operator">:</span><span class="org-variable-name">action</span> <span class="org-tuareg-font-lock-operator">=</span>
    <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">outgoing</span> <span class="org-tuareg-font-lock-operator">=</span> mk_outgoing g
    <span class="org-tuareg-font-lock-governing">and</span> <span class="org-variable-name">visited</span>  <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Int.Set.</span>empty
    <span class="org-tuareg-font-lock-governing">and</span> <span class="org-variable-name">to_visit</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Queue.</span>create <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">()</span></span> <span class="org-tuareg-font-lock-governing">in</span>
    <span class="org-tuareg-font-lock-module">Queue.</span>enqueue to_visit root<span class="org-tuareg-font-lock-operator">;</span>
    <span class="org-tuareg-font-lock-governing">let</span> <span class="org-tuareg-font-lock-governing">rec</span> <span class="org-function-name">loop</span><span class="org-variable-name"> visited</span> <span class="org-tuareg-font-lock-operator">=</span>
      <span class="org-tuareg-font-lock-module">Option.</span>value_map
        <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-tuareg-font-lock-module">Queue.</span>dequeue to_visit<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>
        <span class="org-tuareg-font-lock-label">~default</span><span class="org-tuareg-font-lock-operator">:</span><span class="org-tuareg-font-lock-constructor">None</span>
        <span class="org-tuareg-font-lock-label">~f</span><span class="org-tuareg-font-lock-operator">:</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span><span class="org-keyword">fun</span> <span class="org-variable-name">id</span> <span class="org-tuareg-font-lock-operator">-&gt;</span>
            <span class="org-keyword">if</span> action id <span class="org-keyword">then</span> <span class="org-tuareg-font-lock-constructor">Some</span> id
            <span class="org-keyword">else</span> <span class="org-tuareg-font-lock-governing">begin</span>
              <span class="org-keyword">if</span> <span class="org-tuareg-font-lock-operator">not</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-tuareg-font-lock-module">Int.Set.</span>mem visited id<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span> <span class="org-keyword">then</span>
                <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">children</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Int.Set.</span>diff <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span>outgoing id<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span> visited <span class="org-tuareg-font-lock-governing">in</span>
                <span class="org-tuareg-font-lock-module">Int.Set.</span>iter children <span class="org-tuareg-font-lock-label">~f</span><span class="org-tuareg-font-lock-operator">:</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-keyword">fun</span> <span class="org-variable-name">n</span> <span class="org-tuareg-font-lock-operator">-&gt;</span> <span class="org-tuareg-font-lock-module">Queue.</span>enqueue to_visit n<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-tuareg-font-lock-operator">;</span>
                <span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">visited'</span> <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-module">Int.Set.</span>add visited id <span class="org-tuareg-font-lock-governing">in</span>
                loop visited'
              <span class="org-keyword">else</span>
                loop visited
            <span class="org-tuareg-font-lock-governing">end</span>
          <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>
    <span class="org-tuareg-font-lock-governing">in</span> loop visited

  <span class="org-tuareg-font-lock-governing">let</span> <span class="org-function-name">route</span><span class="org-variable-name"> g n1 n2</span> <span class="org-tuareg-font-lock-operator">=</span>
    <span class="org-tuareg-font-lock-module">Option.</span>is_some <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">(</span></span>bfs_traverse_until g n1 <span class="org-tuareg-font-lock-label">~f</span><span class="org-tuareg-font-lock-operator">:</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span><span class="org-keyword">fun</span> <span class="org-variable-name">node</span> <span class="org-tuareg-font-lock-operator">-&gt;</span> node <span class="org-tuareg-font-lock-operator">=</span> n2<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">)</span></span>
<span class="org-tuareg-font-lock-governing">end</span>

<span class="org-tuareg-font-lock-governing">let</span> <span class="org-variable-name">my_graph</span> <span class="org-tuareg-font-lock-operator">:</span> <span class="org-tuareg-font-lock-module">Graph.</span><span class="org-type">graph </span><span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">{</span></span> <span class="org-tuareg-font-lock-module">Graph.</span>nodes <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">[</span></span>1<span class="org-tuareg-font-lock-operator">;</span>2<span class="org-tuareg-font-lock-operator">;</span>3<span class="org-tuareg-font-lock-operator">;</span>4<span class="org-tuareg-font-lock-operator">;</span>5<span class="org-tuareg-font-lock-operator">;</span>6<span class="org-tuareg-font-lock-operator">;</span>7<span class="org-tuareg-font-lock-operator">;</span>8<span class="org-tuareg-font-lock-operator">;</span>9<span class="org-tuareg-font-lock-operator">;</span>10<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">]</span></span>
  <span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-module">Graph.</span>edges <span class="org-tuareg-font-lock-operator">=</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">[</span></span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>1<span class="org-tuareg-font-lock-operator">,</span>2<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>1<span class="org-tuareg-font-lock-operator">,</span>3<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>1<span class="org-tuareg-font-lock-operator">,</span>5<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>1<span class="org-tuareg-font-lock-operator">,</span>8<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>1<span class="org-tuareg-font-lock-operator">,</span>9<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span>
                  <span class="org-tuareg-font-lock-operator">;</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>2<span class="org-tuareg-font-lock-operator">,</span>3<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>2<span class="org-tuareg-font-lock-operator">,</span>10<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>2<span class="org-tuareg-font-lock-operator">,</span>7<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span>
                  <span class="org-tuareg-font-lock-operator">;</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>3<span class="org-tuareg-font-lock-operator">,</span>8<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span>
                  <span class="org-tuareg-font-lock-operator">;</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>4<span class="org-tuareg-font-lock-operator">,</span>6<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>4<span class="org-tuareg-font-lock-operator">,</span>10<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span>
                  <span class="org-tuareg-font-lock-operator">;</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>5<span class="org-tuareg-font-lock-operator">,</span>4<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>5<span class="org-tuareg-font-lock-operator">,</span>6<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span>
                  <span class="org-tuareg-font-lock-operator">;</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>6<span class="org-tuareg-font-lock-operator">,</span>3<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span>
                  <span class="org-tuareg-font-lock-operator">;</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>7<span class="org-tuareg-font-lock-operator">,</span>8<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>7<span class="org-tuareg-font-lock-operator">,</span>10<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>7<span class="org-tuareg-font-lock-operator">,</span>1<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span>
                  <span class="org-tuareg-font-lock-operator">;</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>8<span class="org-tuareg-font-lock-operator">,</span>9<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>8<span class="org-tuareg-font-lock-operator">,</span>6<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span>
                  <span class="org-tuareg-font-lock-operator">;</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>9<span class="org-tuareg-font-lock-operator">,</span>6<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>9<span class="org-tuareg-font-lock-operator">,</span>3<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span>
                  <span class="org-tuareg-font-lock-operator">;</span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>10<span class="org-tuareg-font-lock-operator">,</span>9<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator">;</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">(</span></span>10<span class="org-tuareg-font-lock-operator">,</span>8<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-3">)</span></span><span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">]</span></span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">}</span></span>
</pre>
</div>

<p>
Here&rsquo;s how I tested it:
</p>
<pre class="example">
utop[2]&gt; Graph.route;;
- : Graph.graph -&gt; int -&gt; int -&gt; bool = &lt;fun&gt;
utop[4]&gt; Graph.route my_graph 1 10;;
- : bool = true
utop[5]&gt; Graph.route my_graph 10 1;;
- : bool = false
utop[6]&gt; Graph.route my_graph 3 9;;
- : bool = true
utop[7]&gt; Graph.route my_graph 4 7;;
- : bool = false
</pre>

<p>
</div>
</p>
</div>
<div id="postamble" class="status">
<a href="archive.html">Archive</a>
</div>
</body>
</html>
